Autodesk.Revit.DB.HorizontalAlignmentStyle
Declares the horizontal alignment style of font.
Since:
2011

Autodesk.Revit.DB.HorizontalAlignmentStyle.Right
Alignment to right

Autodesk.Revit.DB.HorizontalAlignmentStyle.Center
Alignment to center

Autodesk.Revit.DB.HorizontalAlignmentStyle.Left
Alignment to left